# CantChangeParamRotate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PointFailures..::..CantChangeParamRotate Property
BuiltInFailures..::..PointFailures Class See Also
---
Can't rotate Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantChangeParamRotate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantChangeParamRotate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantChangeParamRotate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PointFailures Class
Autodesk.Revit.DB Namespace